src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолСотрудника</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетиСотрудников</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ПолСотрудника/ПолСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолСотрудника</name>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
  <enumValues>
    <name>Женский</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьФИО();
	
	Если ПустаяСтрока(Объект.Отчество) Тогда
		Возврат;
		//Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолСотрудника.ПустаяСсылка");
		//Объект.Пол = "";
	КонецЕсли; 
	
	ОкончаниеОтчества = НРег(Прав(Объект.Отчество, 2));
	Если ОкончаниеОтчества = "на" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолСотрудника.Женский");
	ИначеЕсли ОкончаниеОтчества = "ич" Тогда
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолСотрудника.Мужской");
	Иначе
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолСотрудника.ПустаяСсылка");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФИО()
	Объект.Наименование = Объект.Фамилия + " " + Лев(Объект.Имя,1) + "." + Лев(Объект.Отчество, 1) + ".";
КонецПроцедуры
